## 习题 2
rm(list=ls(all=TRUE))
n <- 30
x <- runif(n, 0, 10)
y <- 5 + 2*x + rnorm(n)
plot(x, y)

##################################################################
## 习题 7
rm(list=ls(all=TRUE))
seq(0, 10, by=3)
seq(0, 10, length.out=4)

##################################################################
## 习题 8
rm(list=ls(all=TRUE))
x <- rep(1:4, c(5, 3, 4, 2)); x

##################################################################
## 习题 9
rm(list=ls(all=TRUE))
A <- matrix(1:20, nr = 4, nc = 5); A
B <- matrix(1:20, nr = 4, nc = 5, byrow = TRUE); B
C <- A[1:3, 1:3]; C
D <- B[,-3]; D

##################################################################
## 习题 10
rm(list=ls(all=TRUE))
x <- seq(from =1, to = 9, by =2); x
cbind(1, x, x^2)

##################################################################
## 习题 11
rm(list=ls(all=TRUE))
H <- matrix(0, nr = 5, nc = 5)
for (i in 1:5){
    for (j in 1:5){
        H[i,j] <- 1/(i+j-1)
    }
}
H

##################################################################
## 习题 12
rm(list=ls(all=TRUE))
student <- data.frame(
   姓名=c('张三', '李四', '王五', '赵六', '丁一'), 
   性别=c( '女',   '男',   '女',  '男',   '女'), 
   年龄=c(   14,    15,    16,    14,     15), 
   身高=c(  156,   165,   157,   162,    159), 
   体重=c( 42.0,  49.0,  41.5,  52.0,   45.5)
)
student

##################################################################
## 习题 13
rm(list=ls(all=TRUE))
rt <- read.table("student.data"); rt

##################################################################
## 习题 14
rm(list=ls(all=TRUE))
scan(file = "", what = list(num=0, name="", x=0))
    1  dog  3
    2  cat  5
    3  duck 7

##################################################################
## 习题 15
rm(list=ls(all=TRUE))
install.packages("RODBC")
library(RODBC)
con <- odbcConnectExcel("student.xls")
tbls <- sqlTables(con)
sh1 <-sqlFetch(con, tbls$TABLE_NAME[1])
close(con)

##################################################################
## 习题 16
rm(list=ls(all=TRUE))
